[
  {
    "text": "PowerPro Electric upgraded our entire electrical panel and added new outlets throughout our home. Professional, clean, and reasonably priced. Highly recommend!",
    "author": "Sarah Johnson",
    "position": "Homeowner"
  },
  {
    "text": "We needed emergency electrical repairs for our restaurant. They arrived within an hour and had everything fixed quickly. Outstanding service!",
    "author": "Michael Chen",
    "position": "Business Owner"
  },
  {
    "text": "The team at PowerPro Electric installed new lighting fixtures in our office. They were efficient, courteous, and the quality of work was top-notch.",
    "author": "Emily Davis",
    "position": "Office Manager"
  },
  {
    "text": "From consultation to installation, PowerPro Electric provided excellent service for our home renovation project. We couldn't be happier with the results!",
    "author": "James O'Connor",
    "position": "Homeowner"
  },
  {
    "text": "PowerPro Electric is our go-to for all electrical needs. Their technicians are knowledgeable and always go the extra mile to ensure everything is perfect.",
    "author": "Olivia Maher",
    "position": "Property Manager"
  },
  {
    "text": "They installed a backup generator for our business, ensuring we stay operational during power outages. Reliable and professional service from start to finish.",
    "author": "David Brown",
    "position": "Business Owner"
  },
  {
    "text": "The electricians at PowerPro Electric were friendly and efficient while rewiring our older home. They respected our space and left everything clean.",
    "author": "Sophia Lee",
    "position": "Homeowner"
  },
  {
    "text": "We had a great experience with PowerPro Electric when they upgraded our commercial lighting system. The energy savings have been significant!",
    "author": "William Fintan",
    "position": "Facility Manager"
  },
  {
    "text": "PowerPro Electric provided excellent customer service and high-quality workmanship when installing our new outdoor lighting. Highly recommend!",
    "author": "Isabella Byrne",
    "position": "Homeowner"
  },
  {
    "text": "Their team was prompt, professional, and knowledgeable when they installed our smart home electrical system. We love the convenience it provides!",
    "author": "Liam Anderson",
    "position": "Tech Enthusiast"
  }
]
